import shutil
import os

language = "hi"
lang_ind = 11
folders = ["final", "inverted", "regular"]

alphabets = [
  ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"],
  ["A", "Á", "B", "C", "D", "E", "É", "F", "G", "H", "I", "Í", "J", "K", "L", "M", "N", "Ñ", "O", "Ó", "P", "Q", "R", "S", "T", "U", "Ú", "Ü", "V", "W", "X", "Y", "Z", "´"],
  ["A", "À", "Â", "B", "C", "Ç", "D", "E", "É", "È", "Ê", "Ë", "F", "G", "H", "I", "Î", "Ï", "J", "K", "L", "M", "N", "O", "Ô", "Œ", "P", "Q", "R", "S", "T", "U", "Ù", "Û", "Ü", "V", "W", "X", "Y", "Z"],
  ["あ", "い", "う", "え", "お", "か", "き", "く", "け", "こ", "さ", "し", "す", "せ", "そ", "た", "ち", "つ", "て", "と", "な", "に", "ぬ", "ね", "の", "は", "ひ", "ふ", "へ", "ほ", "ま", "み", "む", "め", "も", "や", "ゆ", "よ", "ら", "り", "る", "れ", "ろ", "わ", "を", "ん", "が", "ぎ", "ぐ", "げ", "ご", "ざ", "じ", "ず", "ぜ", "ぞ", "だ", "ぢ", "づ", "で", "ど", "ば", "び", "ぶ", "べ", "ぼ", "ぱ", "ぴ", "ぷ", "ぺ", "ぽ", "ぁ", "ぃ", "ぅ", "ぇ", "ぉ", "ゃ", "ゅ", "ょ", "っ"],
  ["ㄅ", "ㄆ", "ㄇ", "ㄈ", "ㄉ", "ㄊ", "ㄋ", "ㄌ", "ㄍ", "ㄎ", "ㄏ", "ㄐ", "ㄑ", "ㄒ", "ㄓ", "ㄔ", "ㄕ", "ㄖ", "ㄗ", "ㄘ", "ㄙ", "ㄚ", "ㄛ", "ㄜ", "ㄝ", "ㄞ", "ㄟ", "ㄠ", "ㄡ", "ㄢ", "ㄣ", "ㄤ", "ㄥ", "ㄦ", "ㄧ", "ㄨ", "ㄩ"],
  ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"],
  ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "Ä", "Ö", "Ü", "ẞ"],
  ["ㄱ", "ㄲ", "ㄴ", "ㄷ", "ㄸ", "ㄹ", "ㅁ", "ㅂ", "ㅃ", "ㅅ", "ㅆ", "ㅇ", "ㅈ", "ㅉ", "ㅊ", "ㅋ", "ㅌ", "ㅍ", "ㅎ", "ㅏ", "ㅐ", "ㅑ", "ㅒ", "ㅓ", "ㅔ", "ㅕ", "ㅖ", "ㅗ", "ㅛ", "ㅜ", "ㅠ", "ㅡ", "ㅣ"],
  ["A", "Б", "B", "Г", "Д", "E", "Ë", "Ж", "З", "И", "Й", "K", "Л", "M", "H", "O", "П", "P", "C", "T", "У", "Ф", "X", "Ц", "Ч", "Ш", "Щ", "Ъ", "Ы", "Ь", "Э", "Ю", "Я"],
  ['ء', 'ا', 'ة', 'ب', 'ن', 'ؤ', 'ك', 'م', 'آ', 'ئ', 'ه', 'ي', 'أ', 'ت', 'و', 'ى', 'ث', 'ر', 'ج', 'ز', 'ل', 'ع', 'خ', 'ذ', 'د', 'إ', 'س', 'ف', 'ش', 'ق', 'ض', 'غ', 'ح', 'ص', 'ط', 'ظ'],
  ["A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z"],
  ['स', 'ि', 'त', 'ा', 'र', 'म', 'छ', 'ल', 'ी', 'इ', 'ट', 'ु', '्', 'े', 'ं', 'व', 'श', 'ख', 'न', 'क', 'ई', 'य', 'प', 'उ', 'थ', 'ो', 'ष', 'ए', 'अ', 'ज', 'च', 'ू', 'भ', '़', 'द', 'घ', 'ध', 'ृ', 'ँ', 'ह', 'ण', 'आ', 'ढ', 'ब', 'ड़', 'फ', 'ग', 'ड', 'ठ', 'झ', 'ौ', 'ै', 'ञ'],

]

for i in range(len(folders)):
    os.mkdir(language + "-letters/" + folders[i] + '-copy')
    for j in range(len(alphabets[lang_ind])):
        shutil.copy(language + "-letters/" + folders[i] + "/" + alphabets[lang_ind][j] + '.png', language + "-letters/" + folders[i] + "-copy/" + str(j) + ".png")